HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_OFF (7)

/** \\brief  Length for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_OFF (2)

/** \\brief  Length for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_OFF (3)

/** \\brief  Length for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_OFF (18)

/** \\brief  Length for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_OFF (26)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_OFF (4)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_OFF (5)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_OFF (1)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_OFF (16)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_OFF (24)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_OFF (6)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_OFF (8)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_OFF (9)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_OFF (10)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_OFF (17)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_OFF (25)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_OFF (11)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_OFF (0)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_OFF (7)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_OFF (2)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_OFF (3)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_OFF (18)

/** \\brief  Length for Ifx_ERAY_EIES_Bits.TABBE */
#define IFX_ERAY_EIES_TABBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIES_Bits.TABBE */
#define IFX_ERAY_EIES_TABBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIES_Bits.TABBE */
#define IFX_ERAY_EIES_TABBE_OFF (26)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_OFF (4)

/** \\brief  Length for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_MSK (0x1)

