HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_OFF (24)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_OFF (25)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_OFF (26)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_OFF (27)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_OFF (28)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_OFF (29)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_OFF (30)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_OFF (31)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_OFF (4)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_OFF (5)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_OFF (6)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_OFF (7)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_OFF (8)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_OFF (9)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_OFF (10)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_OFF (11)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_OFF (12)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_OFF (13)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_OFF (14)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_OFF (15)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_OFF (16)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_OFF (17)

