HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_OFF (13)

