HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_OFF (9)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_OFF (10)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_OFF (11)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_OFF (12)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_OFF (13)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_OFF (15)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_OFF (16)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_OFF (17)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_OFF (18)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_OFF (19)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_OFF (20)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_OFF (22)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_OFF (23)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_OFF (24)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_OFF (25)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_OFF (26)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_OFF (27)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_OFF (28)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_OFF (29)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_OFF (30)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_OFF (31)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_OFF (0)

